{
  "raw_text": "A future e+/e− linear collider is planned to be built in order to obtain precise measurements (at the T eV scale) which would be complementary to the ones from the LHC. One of the challenges of this linear collider will be to focus the beam down to nanometer level transverse sizes at the interaction point, to obtain a high luminosity of a few 10−34cm2s−1. The two linear collider projects (ILC and CLIC) require beam delivery systems with the same local chromaticity correction scheme in the final focus. ATF2 at KEK (Japan), an implementation of this scheme scaled down in energy, uses the beam extracted from ATF, which is one of the most successful damping rings in the world. The ATF2 goals are to prove the feasibility and the stability of the linear collider final focus system and to define and test the experimental correction procedures. The nominal beam sizes at the interaction point are 3μm horizontally and 37nm vertically. The work in this thesis was started before the commissioning and covered its first year at KEK. At the beginning, we observed that the striplines BPMs were not working properly so we investigated their behavior in detail. The problem was characterized and later solved in 2010 by upgrading the electronics. We then developed an efficient procedure to check the modeling of the beam line, comparing measurements of transfer matrices to model predictions calculated on line. After obtaining a good agreement, we were able to successfully test the trajectory correction algorithm which had been developed, reducing the difference between BPM measurements and the target values down to 0.5mm horizontally and 0.2mm vertically. We also successfully developed an algorithm to reconstruct pulse to pulse beam trajectory fluctuations with sub-micron precision. This reconstruction also gave a precise determination of the energy fluctuation, allowing a global fit of the dispersion function along the beam line with a precision of a few mm, dominated by systematic errors from transfer matrices and BPMs scale factor uncertainties. A simple and robust IP beam size tuning method using sextupoles displacements was also studied in simulation, whose performance indicates that, given some assumptions on the error level of the beam, convergence within 20% of the nominal beam size should be possible in 8 hours with a 80% probability. The first experimental tests of such beam size tuning methods, based on measurements at the interaction point are on-going in 2010 and 2011."
}